000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ИнформационныеКарты/ИнформационныеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеКарты</name>
  <comment>(Упр) Магнитные и штриховые карты.</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДисконтнойКарты</name>
    <type>
      <types>CatalogRef.ВидыДисконтныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКарты</name>
    <type>
      <types>EnumRef.ВидыИнформационныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецКарты</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоОпроса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующегоОпроса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КодКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <comment>Магазин, где была проведена выдача карты</comment>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Резерв</name>
    <comment>(Служ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКарты</name>
    <type>
      <types>EnumRef.ТипыИнформационныхКарт</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ВидыИнформационныхКарт/ВидыИнформационныхКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыИнформационныхКарт</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Штриховая</name>
  </enumValues>
  <enumValues>
    <name>Магнитная</name>
  </enumValues>
  <enumValues>
    <name>Смешанная</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыИнформационныхКарт/ТипыИнформационныхКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИнформационныхКарт</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Дисконтная</name>
  </enumValues>
  <enumValues>
    <name>Регистрационная</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Магазины/Магазины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Магазины</name>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВЭксплуатацию</name>
    <comment>Магазин переведен в режим работы 1С:Розница</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМинимальныхЦенПродажи</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПользователей</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФизЛиц</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПеремещении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрименениеЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрямуюИнкассацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаМагазина</name>
    <comment>Основная денежная касса магазина</comment>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КодФилиала</name>
    <comment>Navision</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерМагазина</name>
    <comment>Используется для начальной загрузки из MForce</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделениеОрганизации</name>
    <comment>Определяет филиал</comment>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Основная организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменаРучныхСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругленияСуммыЧекаВПользуПокупателя</name>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоЦенообразования</name>
    <type>
      <types>CatalogRef.ПравилаЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментИсключаемойНоменклатуры</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПереброски</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПоступления</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладСвязи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладУправляющейСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматМагазина</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ИнформационныеКарты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает список реквизитов, которые не нужно редактировать
// с помощью обработки группового изменения объектов
//
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт

	НеРедактируемыеРеквизиты = Новый Массив;

	НеРедактируемыеРеквизиты.Добавить("КодКарты");
	НеРедактируемыеРеквизиты.Добавить("ИмяПредопределенныхДанных");
	НеРедактируемыеРеквизиты.Добавить("ВладелецКарты");	//	LNK 08.02.2019 13:01:12

	Возврат НеРедактируемыеРеквизиты;

КонецФункции

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#КонецЕсли

#Область СпецификаРаботыMSCRM

//	LNK 06.08.2019 09:37:45
Функция ПолучитьКартыПоВнешнимДанным(ВладелецКарты, ВнешниеДанные, ДисконтнаяКарта = Неопределено, Автор)	Экспорт

//	Параметр "ДисконтнаяКарта" передается, когда нужно назначить карту для дальнейшего использования.

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

//	ВнешниеДанные - массив нижеописанных структур:
//	"КодКарты, Блокирован, IDC_Карта, IDC_Магазин, ДатаОткрытия, ДатаСоздания, ДатаЗакрытия"

	ТаблицаКарт = Новый ТаблицаЗначений;

	ТаблицаКарт.Колонки.Добавить("ВладелецКарты"  , Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаКарт.Колонки.Добавить("ДисконтнаяКарта", Новый ОписаниеТипов("СправочникСсылка.ИнформационныеКарты"));
	ТаблицаКарт.Колонки.Добавить("Соответствует"  , Новый ОписаниеТипов("Булево"));
	ТаблицаКарт.Колонки.Добавить("Блокирован"     , Новый ОписаниеТипов("Булево"));

	Для каждого ДанныеКарты Из ВнешниеДанные Цикл

		СтрокаТаблицы = ТаблицаКарт.Добавить();
		ПолучитьСоставКарты(ВладелецКарты, ДанныеКарты, СтрокаТаблицы, Автор);

	КонецЦикла;

	ТаблицаКарт.Сортировать("Соответствует Убыв, Блокирован");

	Если НЕ ТаблицаКарт.Количество() = 0 Тогда

		ДисконтнаяКарта = ТаблицаКарт[0].ДисконтнаяКарта;

	КонецЕсли;

	Возврат ТаблицаКарт;

КонецФункции

//	LNK 06.08.2019 09:52:49
Процедура ПолучитьСоставКарты(ВладелецКарты, ДанныеКарты, СтрокаТаблицы, Автор)

	Если НЕ ПустаяСтрока(ДанныеКарты.IDC_Карта) Тогда

		СтрокаТаблицы.ДисконтнаяКарта = Справочники.ИнформационныеКарты.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеКарты.IDC_Карта));

		Если СтрокаТаблицы.ДисконтнаяКарта.ПолучитьОбъект() = Неопределено Тогда

			СтрокаТаблицы.ДисконтнаяКарта = Справочники.ИнформационныеКарты.ПустаяСсылка();

		КонецЕсли;

	КонецЕсли;

	Если СтрокаТаблицы.ДисконтнаяКарта.Пустая() И НЕ ПустаяСтрока(ДанныеКарты.КодКарты) Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТаблицаСправочник.Ссылка КАК ДисконтнаяКарта
		|ИЗ
		|	Справочник.ИнформационныеКарты КАК ТаблицаСправочник
		|ГДЕ
		|	ТаблицаСправочник.КодКарты = &КодКарты"
		);
		Запрос.УстановитьПараметр("КодКарты", ДанныеКарты.КодКарты);

		Выборка = Запрос.Выполнить().Выбрать();

		Если Выборка.Следующий() Тогда

			СтрокаТаблицы.ДисконтнаяКарта = Выборка.ДисконтнаяКарта;

		КонецЕсли;

	КонецЕсли;

	Если СтрокаТаблицы.ДисконтнаяКарта.Пустая() И НЕ ПустаяСтрока(ДанныеКарты.КодКарты) Тогда

		КартаОбъект = Справочники.ИнформационныеКарты.СоздатьЭлемент();

		Если НЕ ПустаяСтрока(ДанныеКарты.IDC_Карта) Тогда

			КартаОбъект.УстановитьСсылкуНового(Справочники.ИнформационныеКарты.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеКарты.IDC_Карта)));

		КонецЕсли;

		КартаОбъект.ВидКарты = Перечисления.ВидыИнформационныхКарт.Магнитная;
		КартаОбъект.ТипКарты = Перечисления.ТипыИнформационныхКарт.Дисконтная;
		КартаОбъект.ВидДисконтнойКарты = Справочники.ВидыДисконтныхКарт.НакопительныеКарты;

		КартаОбъект.Наименование  = ?(ТипЗнч(ДанныеКарты.КодКарты) = Тип("Число"), Формат(ДанныеКарты.КодКарты, "ЧН=0; ЧГ="), ДанныеКарты.КодКарты);
		КартаОбъект.КодКарты      = ?(ТипЗнч(ДанныеКарты.КодКарты) = Тип("Число"), Формат(ДанныеКарты.КодКарты, "ЧН=0; ЧГ="), ДанныеКарты.КодКарты);
		КартаОбъект.ВладелецКарты = ВладелецКарты;
		КартаОбъект.Блокирован    = ДанныеКарты.Блокирован;
		КартаОбъект.ДатаОткрытия  = ДанныеКарты.ДатаОткрытия;
		КартаОбъект.ДатаСоздания  = ДанныеКарты.ДатаСоздания;
		КартаОбъект.ДатаЗакрытия  = ДанныеКарты.ДатаЗакрытия;

		КартаОбъект.Автор = Автор;

		Если НЕ ПустаяСтрока(ДанныеКарты.IDC_Магазин) Тогда

			КартаОбъект.Магазин = Справочники.Магазины.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеКарты.IDC_Магазин));

		КонецЕсли;

		КартаОбъект.УстановитьНовыйКод();

		КартаОбъект.Записать();

		СтрокаТаблицы.ДисконтнаяКарта = КартаОбъект.Ссылка;
		СтрокаТаблицы.ВладелецКарты   = ВладелецКарты;
		СтрокаТаблицы.Соответствует   = Истина;
		СтрокаТаблицы.Блокирован      = КартаОбъект.Блокирован;

	ИначеЕсли НЕ СтрокаТаблицы.ДисконтнаяКарта.Пустая() Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТаблицаСправочник.Ссылка КАК ДисконтнаяКарта,
		|	ТаблицаСправочник.ВладелецКарты КАК ВладелецКарты,
		|	ТаблицаСправочник.Блокирован
		|		ИЛИ ТаблицаСправочник.ПометкаУдаления КАК Блокирован
		|ИЗ
		|	Справочник.ИнформационныеКарты КАК ТаблицаСправочник
		|ГДЕ
		|	ТаблицаСправочник.Ссылка = &ДисконтнаяКарта"
		);
		Запрос.УстановитьПараметр("ДисконтнаяКарта", СтрокаТаблицы.ДисконтнаяКарта);

		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();

		СтрокаТаблицы.ВладелецКарты   = Выборка.ВладелецКарты;
		СтрокаТаблицы.Соответствует   = Выборка.ВладелецКарты = ВладелецКарты;
		СтрокаТаблицы.Блокирован      = Выборка.Блокирован;
 
	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти

#Область ПоддержкаФункционалаВиртуальныхКарт	//	LNK 10.08.2021 17:56:32

Функция СписокПрефиксовПоУмолчанию()	Экспорт

	СписокПрефиксов = Новый Массив;

	ПрефиксТекущий = "ANT";
	СписокПрефиксов.Добавить(ПрефиксТекущий);

	Для Индекс = 0 По 2 Цикл

		Позиция = 3 - Индекс;

		Для КодЛитеры = 65 По 90 Цикл

			Буффер = СтрЗаменить(ПрефиксТекущий, Сред(ПрефиксТекущий, Позиция, 1), Символ(КодЛитеры));

			Если СписокПрефиксов.Найти(Буффер) = Неопределено Тогда

				СписокПрефиксов.Добавить(Буффер);

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

	Возврат СписокПрефиксов;

КонецФункции

#КонецОбласти
